src/Catalogs/КатегорииДоходов/КатегорииДоходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КатегорииДоходов</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Зарплата</name>
      <description>Зарплата</description>
    </items>
    <items>
      <name>Бонус</name>
      <description>Бонус</description>
    </items>
    <items>
      <name>ПроцентыКешбэк</name>
      <description>Проценты / кешбэк</description>
    </items>
    <items>
      <name>ВозвратСредств</name>
      <description>Возврат средств</description>
    </items>
    <items>
      <name>ПрочийДоход</name>
      <description>Прочие доходы</description>
    </items>
  </predefined>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодИконки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьВВыборе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/КатегорииДоходов/Forms/ФормаЭлемента/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Форма элемента категории доходов (Wallet HTML).
////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() И Не ЗначениеЗаполнено(Объект.КодИконки) Тогда
		
		Объект.ПоказыватьВВыборе = Истина;
		Объект.КодИконки = "wallet";
		
	ИначеЕсли Не Объект.ПоказыватьВВыборе И Не ЗначениеЗаполнено(Объект.КодИконки) Тогда
		
		Объект.ПоказыватьВВыборе = Истина;
		
	КонецЕсли;
	
	Заголовок = "Категория дохода";
	ОбновитьHTMLНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПолеHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	КомандаПриложения = ИзвлечьКомандуИзСсылки(ДанныеСобытия.Href);
	
	Если Не ЗначениеЗаполнено(КомандаПриложения) Или КомандаПриложения = "noop" Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если КомандаПриложения = "back" Тогда
		
		Закрыть();
		
	ИначеЕсли КомандаПриложения = "icons" Тогда
		
		РежимВыбораИконки = Истина;
		РежимВыбораРодителя = Ложь;
		ОбновитьHTMLНаСервере();
		
	ИначеЕсли КомандаПриложения = "icons-back" Тогда
		
		РежимВыбораИконки = Ложь;
		ОбновитьHTMLНаСервере();
		
	ИначеЕсли КомандаПриложения = "parent" Тогда
		
		РежимВыбораРодителя = Истина;
		РежимВыбораИконки = Ложь;
		ОбновитьHTMLНаСервере();
		
	ИначеЕсли КомандаПриложения = "parent-back" Тогда
		
		РежимВыбораРодителя = Ложь;
		ОбновитьHTMLНаСервере();
		
	ИначеЕсли КомандаПриложения = "set-parent-empty" Тогда
		
		Объект.Родитель = ПредопределенноеЗначение("Справочник.КатегорииДоходов.ПустаяСсылка");
		РежимВыбораРодителя = Ложь;
		ОбновитьHTMLНаСервере();
		
	ИначеЕсли СтрНачинаетсяС(КомандаПриложения, "set-parent:") Тогда
		
		Объект.Родитель = ОбщийМодульСервер_Категории.КатегорияПоИдентификатору(Ложь, Сред(КомандаПриложения, 12));
		РежимВыбораРодителя = Ложь;
		ОбновитьHTMLНаСервере();
		
	ИначеЕсли СтрНачинаетсяС(КомандаПриложения, "icon:") Тогда
		
		Объект.КодИконки = Сред(КомандаПриложения, 6);
		РежимВыбораИконки = Ложь;
		ОбновитьHTMLНаСервере();
		
	ИначеЕсли КомандаПриложения = "name" Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВводаНаименования", ЭтотОбъект);
		ОбщийМодульКлиент.ПоказатьВводТекста(ОписаниеОповещения, Объект.Наименование, "Наименование", 30);
		
	ИначеЕсли КомандаПриложения = "desc" Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВводаОписания", ЭтотОбъект);
		ОбщийМодульКлиент.ПоказатьВводТекста(ОписаниеОповещения, Объект.Описание, "Описание", 100);
		
	ИначеЕсли КомандаПриложения = "toggle-show" Тогда
		
		Объект.ПоказыватьВВыборе = Не Объект.ПоказыватьВВыборе;
		ОбновитьHTMLНаСервере();
		
	ИначеЕсли КомандаПриложения = "save" Тогда
		
		ПодключитьОбработчикОжидания("ЗаписатьКатегориюОтложенно", 0.05, Истина);
		
	ИначеЕсли КомандаПриложения = "delete" Тогда
		
		Если Объект.Предопределенный Тогда
			
			Возврат;
			
		КонецЕсли;
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПодтвержденияУдаления", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, "Удалить категорию?", РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеВводаНаименования(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Объект.Наименование = Результат;
	ОбновитьHTMLНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаОписания(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Объект.Описание = Результат;
	ОбновитьHTMLНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПодтвержденияУдаления(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если УдалитьКатегориюНаСервере() Тогда
		
		Оповестить("КатегорииДоходовИзменены");
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьКатегориюОтложенно() Экспорт
	
	ТекстОшибки = ЗаписатьКатегориюНаСервере();
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		
		ПоказатьПредупреждение(, ТекстОшибки);
		Возврат;
		
	КонецЕсли;
	
	Оповестить("КатегорииДоходовИзменены");
	
	Если Открыта() Тогда
		
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗаписатьКатегориюНаСервере()
	
	Если Не ЗначениеЗаполнено(Объект.Наименование) Тогда
		
		Возврат "Укажите наименование категории";
		
	КонецЕсли;
	
	СправочникОбъект = РеквизитФормыВЗначение("Объект");
	СправочникОбъект.Записать();
	ЗначениеВРеквизитФормы(СправочникОбъект, "Объект");
	
	Возврат "";
	
КонецФункции

&НаСервере
Функция УдалитьКатегориюНаСервере()
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Возврат Истина;
		
	КонецЕсли;
	
	ОбъектКатегории = Объект.Ссылка.ПолучитьОбъект();
	ОбъектКатегории.УстановитьПометкуУдаления(Истина);
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура ОбновитьHTMLНаСервере()
	
	ДанныеКатегории = ОбщийМодульСервер_Категории.ДанныеКатегорииДляHTML(
		Ложь,
		Объект.Ссылка,
		Объект.Наименование,
		Объект.Описание,
		Объект.КодИконки,
		Объект.ПоказыватьВВыборе,
		Объект.Предопределенный,
		Объект.Родитель);
	ТекстHTML = ОбщийМодульСервер_Категории.HTMLЭлементаКатегории(Ложь, ДанныеКатегории, РежимВыбораИконки,
		РежимВыбораРодителя);
	
КонецПроцедуры

&НаКлиенте
Функция ИзвлечьКомандуИзСсылки(АдресСсылки)
	
	Если Не ЗначениеЗаполнено(АдресСсылки) Тогда
		
		Возврат "";
		
	КонецЕсли;
	
	Позиция = СтрНайти(НРег(АдресСсылки), "app:");
	
	Если Позиция = 0 Тогда
		
		Возврат "";
		
	КонецЕсли;
	
	Возврат Сред(АдресСсылки, Позиция + 4);
	
КонецФункции

#КонецОбласти
